# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

fruits = ['яблоко', 'банан', 'киви', 'арбуз', 'апельсин']
i = 1
for f in fruits:
	print('{}'.format(i) + '. {:>10}'.format(f))
	i += 1