# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.
list_1 = [2, 7, 5, 6, 9, 15]
list_2 = []
last_name = len(list_1)
for i in range(last_name):
	if list_1[i] % 2 == 0:
		list_2.append(list_1[i] / 4)
	else:
		list_2.append(list_1[i] * 2)
print(list_2)