#Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.
b = {'1','4','5','0','2','6'}
d = {'4','8','6','1'}
c = b - d
print(list(c))