date = '02.11.2013'
day = int(date[0:2])
mouth = int(date[3:5])
year = int(date[6:10])
print(day, mouth, year)
titles = {
	    'days':
	        {1: 'первое', 2: 'второе', 3: 'третье', 4: 'четвертое', 5: 'пятое', 6: 'шестое', 7: 'седьмое', 8: 'восьмое',
	         9: 'девятое', },
	    'months':
	        {1: 'января', 2: 'февраля', 3: 'марта', 4: 'апреля', 5: 'мая', 6: 'июня', 7: 'июля', 8: 'августа',
	         9: 'сентября', 10: 'октября', 11: 'ноября', 12: 'декабря'}
	}
print(titles['days'][day], titles['months'][mouth], year, 'года')