# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4
lst = [9, -2, 78, -34, 51, 7, -73, 10, -49]
lst_result = [x for x in lst if x > 0 and x%3 == 0 and x % 4 != 0]
print(lst_result)